[FunctionHelp]
$casenum9=9@$Casenum@$CASENUM@Порядковый номер текущего наблюдения. Для каждого наблюдения $CASENUM представляет собой количество прочитанных наблюдений, включая текущее. Форматом является F8.0. Значение $CASENUM не обязательно совпадает с номером строки в окне Редактора данных (доступном в оконных средах) и меняется при сортировке файла или добавлении новых наблюдений перед концом файла.
$sysmis10=10@$Sysmis@$SYSMIS@Системное пропущенное значение. Системное пропущенное значение отображается точкой (.) или тем символом, который используется в качестве десятичного знака.
$date4=4@$Date@$DATE@Текущая дата в международном формате даты с годом, представленном последними двумя цифрами. Форматом является A9 в виде дд-ммм-гг.
$jdate4=4@$JDate@$JDATE@Текущая дата в виде количества дней, прошедших с 14 октября 1582 г. (от первого дня григорианского календаря). Форматом является F6.0.
$date114=4@$Date11@$DATE11@Текущая дата в международном формате даты с годом, представленном четырьмя цифрами. Форматом является A11 в виде дд-ммм-гггг.
$time4=4@$Time@$TIME@Текущая дата и время. $TIME представляет собой число секунд, прошедших с полуночи 14 октября 1582 года до даты и времени выполнения команды преобразования. Форматом является F20. Возможен вывод данного параметра в виде даты в самых разнообразных форматах. Также возможно его использование в функциях даты и времени.
abs1=1@Abs@ABS(?)@ABS(числвыр). Числовая. Возвращает абсолютное значение числового выражения "числвыр".
any13=13@Any@ANY(?,?)@ANY(критерий, значение[,значение,…]). Логическая. Возвращает 1 или истина, если значение аргумента "критерий" соответствует какому-либо из последующих значений; в других случаях возвращает 0 или ложь. Эта функция требует задания двух или более аргументов. К примеру, ANY(var1, 1, 3, 5) возвращает 1, если значение var1 составляет 1, 3 или 5, и 0 для остальных значений. ANY также может применяться для сканирования списка переменных или выражений на предмет поиска значения. К примеру, ANY(1, var1, var2, var3) возвращает 1, если любая из трех заданных переменных имеет значение 1, и возвращает 0, если все три переменных имеют значения, отличные от 1.
applymodel19=19@Applymodel@ApplyModel(?,?,?)@ApplyModel(дескриптор,"функция", значение). Числовая. Применяет конкретную функцию скоринга к входным данным наблюдений, используя модель, заданную вручную, где "функция" представляет собой одно из следующих текстовых буквенных значений, заключенных в кавычки: predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. Дескриптор модели является именем, соответствующим внешнему файлу XML, как это определено в команде MODEL HANDLE. Необязательный третий аргумент используется с функциями: "probability", "neighbor" и "distance". В функции "probability" он указывает категорию, для которой вычисляется вероятность. В функциях "neighbor" и "distance" он указывает конкретного соседа (как целое число) для моделей ближайшего соседа. ApplyModel возвращает системное пропущенное значение, если значение не может быть вычислено.
arsin1=1@Arsin@ARSIN(?)@ARSIN(числвыр). Числовая. Возвращает значение арксинуса в радианах для числового выражения "числвыр", значение которого должно быть числом между -1 и +1.
artan1=1@Artan@ARTAN(?)@ARTAN(числвыр). Числовая. Возвращает значение арктангенса в радианах для значения числового выражения "числвыр".
cdf.bernoulli2=2@Cdf.Bernoulli@CDF.BERNOULLI(?,?)@CDF.BERNOULLI(q, p). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с распределением Бернулли, имеющим значение параметра, равное p, будет меньше или равно q.
cdf.beta2=2@Cdf.Beta@CDF.BETA(?,?,?)@CDF.BETA(q, форма1, форма2). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с Бета-распределением, имеющим значения параметров, равные "форма1" и "форма2", будет меньше, чем q.
cdf.binom2=2@Cdf.Binom@CDF.BINOM(?,?,?)@CDF.BINOM(q,n,p). Числовая. Возвращает значение накопленной вероятности того, что число успехов в n испытаниях с вероятностью успеха p в каждом из них будет меньше или равно значению q. Если n равно 1, то результат идентичен тому, что дает CDF.BERNOULLI.
cdf.bvnor2=2@Cdf.Bvnor@CDF.BVNOR(?)@CDF.BVNOR(quant1, quant2, корр). Числовая. Возвращает накопленную вероятность того, что значение из стандартного двумерного нормального распределения с данным параметром корреляции будет меньше, чем quant1 и quant2.
cdf.cauchy2=2@Cdf.Cauchy@CDF.CAUCHY(?,?,?)@CDF.CAUCHY(q,плж,мсштб). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с распределением Коши, имеющим заданные значения параметров положения и масштаба, будет меньше, чем q.
cdf.chisq2=2@Cdf.Chisq@CDF.CHISQ(?,?)@CDF.CHISQ(q,стсв). Числовая. Возвращает вероятность того, что значение из распределения хи-квадрат с числом степеней свободы стсв будет меньше, чем q.
cdf.exp2=2@Cdf.Exp@CDF.EXP(?,?)@CDF.EXP(q, мсштб). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с экспоненциальным распределением, имеющим заданное значение параметра масштаба, будет меньше, чем q.
cdf.f2=2@Cdf.F@CDF.F(?,?,?)@CDF.F(q,стсв1,стсв2). Числовая. Возвращает накопленную вероятность того, что значение из F-распределения с числами степеней свободы стсв1 и стсв2 будет меньше, чем q.
cdf.gamma2=2@Cdf.Gamma@CDF.GAMMA(?,?,?)@CDF.GAMMA(q, форма, мсштб). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с гамма - распределением, имеющим заданные значения параметров формы и масштаба, будет меньше, чем q.
cdf.geom2=2@Cdf.Geom@CDF.GEOM(?,?)@CDF.GEOM(q,p) Числовая. Возвращает значение накопленной вероятности того, что число испытаний до первого успеха при заданном значении p вероятности успеха, будет меньше или равно q.
cdf.halfnrm2=2@Cdf.Halfnrm@CDF.HALFNRM(?)@CDF.HALFNRM(q, среднее, стдоткл). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с полу-нормальным распределением, имеющим заданные значения среднего и стандартного отклонения, будет меньше, чем quant.
cdf.hyper2=2@Cdf.Hyper@CDF.HYPER(?,?,?,?)@CDF.HYPER(q, всего, выб, усп) Числовая. Возвращает значение накопленной вероятности того, что число объектов с заданной характеристикой в выборке объема "выб", извлекаемой случайным образом из популяции, имеющей общий объем "всего" и "усп" объектов с заданной характеристикой, будет меньше или равно q.
cdf.igauss2=2@Cdf.Igauss@CDF.IGAUSS(?,?,?)@CDF.IGAUSS(q,плж,мсштб). Числовая. Возвращает накопленную вероятность того, что значение из обратного распределения Гаусса с данными параметрами положения и масштаба будет меньше, чем quant.
cdf.laplace2=2@Cdf.Laplace@CDF.LAPLACE(?,?,?)@CDF.LAPLACE(q, срдн, мсштб). Числовая. Возвращает значение вероятности того, что случайная величина с распределением Лапласа, имеющим заданные значения параметров среднего и масштаба, будет меньше, чем quant.
cdf.lnormal2=2@Cdf.Lnormal@CDF.LNORMAL(?,?,?)@CDF.LNORMAL(q, a, b). Числовая. Возвращает значение вероятности того, что случайная величина с лог-нормальным распределением, имеющим заданные значения параметров, будет меньше, чем q.
cdf.logistic2=2@Cdf.Logistic@CDF.LOGISTIC(?,?,?)@CDF.LOGISTIC(q, срдн, мсштб). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с логистическим распределением, имеющим заданные значения среднего и параметра масштаба, будет меньше, чем q.
cdf.negbin2=2@Cdf.Negbin@CDF.NEGBIN(?,?,?)@CDF.NEGBIN(q, порог, p). Числовая. Возвращает накопленную вероятность того, что число испытаний до получения заданного порогового числа успехов, равного значению "порог", при вероятности успеха, равной p, будет меньше или равно q.
cdf.normal2=2@Cdf.Normal@CDF.NORMAL(?,?,?)@CDF.NORMAL(q, срдн, стдоткл). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с нормальным распределением, имеющим заданные значения среднего и стандартного отклонения, будет меньше, чем q.
cdf.pareto2=2@Cdf.Pareto@CDF.PARETO(?,?,?)@CDF.PARETO(q, порог, форма). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с распределением Парето, имеющим заданные значения параметров "порог" и "форма", будет меньше, чем q.
cdf.poisson2=2@Cdf.Poisson@CDF.POISSON(?,?)@CDF.POISSON(q, срдн). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с распределением Пуассона, имеющим заданное значение среднего или параметра интенсивности, будет меньше или равно q..
cdf.smod2=2@Cdf.Smod@CDF.SMOD(?)@CDF.SMOD(q, a, b). Числовая. Возвращает вероятность того, что значение из распределения стьюдентизированного максимума модуля с заданными параметрами будет меньше, чем quant.
cdf.srange2=2@Cdf.Srange@CDF.SRANGE(?)@CDF.SRANGE(q, a, b). Числовая. Возвращает накопленную вероятность того, что значение из распределения статистики стьюдентизированного размаха с заданными параметрами будет меньше, чем quant.
cdf.t2=2@Cdf.T@CDF.T(?,?)@CDF.T(q,стсв). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с t-распределением Стьюдента, имеющим заданное число степеней свободы df, будет меньше, чем q.
cdf.uniform2=2@Cdf.Uniform@CDF.UNIFORM(?,?,?)@CDF.UNIFORM(q, мин, макс). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с равномерным распределением, имеющим заданные значения минимума и максимума, будет меньше, чем q.
cdf.weibull2=2@Cdf.Weibull@CDF.WEIBULL(?,?,?)@CDF.WEIBULL(q, a, b). Числовая. Возвращает значение накопленной вероятности того, что случайная величина с распределением Вейбулла, имеющим заданные значения параметров, будет меньше, чем q.
cdfnorm2=2@Cdfnorm@CDFNORM(?)@CDFNORM(zзнач). Числовая. Возвращает значение вероятности того, что случайная величина со средним 0 и стандартным отклонением 1 будет меньше величины zзнач, которая должна быть числом.
cfvar15=15@Cfvar@CFVAR(?,?)@CFVAR(числвыр,числвыр[,..]). Числовая. Возвращает значение коэффициента вариации (стандартное отклонение, деленное на среднее значение) для аргументов, имеющих валидные (непропущенные) значения. Эта функция требует двух или более аргументов, которые должны быть числовыми выражениями. Вы можете указать(через точку после имени функции) минимальное число непропущенных аргументов, при котором функция вычисляется.
char.index(2)16=16@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(строка, образец[, делитель]). Числовая. Возвращает число, показывающее позицию символа первого встреченного "образец" в строке "строка". Необязательный третий аргумент "делитель" – это число символов, используемых для разбиения "образец" на отдельные подстроки. Для поиска используется каждая подстрока, и функция возвращает первое вхождение какой-либо из подстрок. Например, CHAR.INDEX(var1, 'abcd') возвращает значение начальной позиции полной строки "abcd" в текстовой переменной var1, CHAR.INDEX(var1, 'abcd', 1) возвращает значение позиции первого появления в строке любого из этих значений, а CHAR.INDEX(var1, 'abcd', 2) возвращает значение первого появления либо "ab", либо "cd". Аргумент "делитель" должен быть положительным целым числом и должен делить нацело длину "образец". Если “образец” не встретился в строке “строка”, то возвращается 0.
char.index(3)16=16@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(строка, образец[, делитель]). Числовая. Возвращает число, показывающее позицию символа первого встреченного "образец" в строке "строка". Необязательный третий аргумент "делитель" – это число символов, используемых для разбиения "образец" на отдельные подстроки. Для поиска используется каждая подстрока, и функция возвращает первое вхождение какой-либо из подстрок. Например, CHAR.INDEX(var1, 'abcd') возвращает значение начальной позиции полной строки "abcd" в текстовой переменной var1, CHAR.INDEX(var1, 'abcd', 1) возвращает значение позиции первого появления в строке любого из этих значений, а CHAR.INDEX(var1, 'abcd', 2) возвращает значение первого появления либо "ab", либо "cd". Аргумент "делитель" должен быть положительным целым числом и должен делить нацело длину "образец". Если “образец” не встретился в строке “строка”, то возвращается 0.
char.index(2)13=13@Char.Index(2)@CHAR.INDEX(?,?)@CHAR.INDEX(строка, образец[, делитель]). Числовая. Возвращает число, показывающее позицию символа первого встреченного "образец" в строке "строка". Необязательный третий аргумент "делитель" – это число символов, используемых для разбиения "образец" на отдельные подстроки. Для поиска используется каждая подстрока, и функция возвращает первое вхождение какой-либо из подстрок. Например, CHAR.INDEX(var1, 'abcd') возвращает значение начальной позиции полной строки "abcd" в текстовой переменной var1, CHAR.INDEX(var1, 'abcd', 1) возвращает значение позиции первого появления в строке любого из этих значений, а CHAR.INDEX(var1, 'abcd', 2) возвращает значение первого появления либо "ab", либо "cd". Аргумент "делитель" должен быть положительным целым числом и должен делить нацело длину "образец". Если “образец” не встретился в строке “строка”, то возвращается 0.
char.index(3)13=13@Char.Index(3)@CHAR.INDEX(?,?,?)@CHAR.INDEX(строка, образец[, делитель]). Числовая. Возвращает число, показывающее позицию символа первого встреченного "образец" в строке "строка". Необязательный третий аргумент "делитель" – это число символов, используемых для разбиения "образец" на отдельные подстроки. Для поиска используется каждая подстрока, и функция возвращает первое вхождение какой-либо из подстрок. Например, CHAR.INDEX(var1, 'abcd') возвращает значение начальной позиции полной строки "abcd" в текстовой переменной var1, CHAR.INDEX(var1, 'abcd', 1) возвращает значение позиции первого появления в строке любого из этих значений, а CHAR.INDEX(var1, 'abcd', 2) возвращает значение первого появления либо "ab", либо "cd". Аргумент "делитель" должен быть положительным целым числом и должен делить нацело длину "образец". Если “образец” не встретился в строке “строка”, то возвращается 0.
char.length16=16@Char.Length@CHAR.LENGTH(?)@CHAR.LENGTH(текствыр). Числовая. Возвращает длину текстового выражения "текствыр" в символах без учета концевых пробелов.
char.lpad(2)16=16@Char.Lpad(2)@CHAR.LPAD(?,?)@CHAR.LPAD(текствыр1,длн[,текствыр2]) Текстовая. Дополняет слева "текствыр1", чтобы значение длины соответствовало значению, заданному "длн", используя необходимое для подгонки число полных копий "текствыр2", как заполняющую строку. Значение длины представляет собой число символов и должно быть положительным целым числом. Если необязательный аргумент "текствыр2" опущен, значение заполняется пробелами.
char.lpad(3)16=16@Char.Lpad(3)@CHAR.LPAD(?,?,?)@CHAR.LPAD(текствыр1,длн[,текствыр2]) Текстовая. Дополняет слева "текствыр1", чтобы значение длины соответствовало значению, заданному "длн", используя необходимое для подгонки число полных копий "текствыр2", как заполняющую строку. Значение длины представляет собой число символов и должно быть положительным целым числом. Если необязательный аргумент "текствыр2" опущен, значение заполняется пробелами.
char.mblen16=16@Char.Mblen@CHAR.mblen(?,?)@CHAR.MBLEN(текствыр,плж). Числовая. Возвращает число байтов в символе на позиции "плж" символа в текстовом выражении "текствыр".
char.rindex(2)16=16@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(строка,образец[,делитель]). Числовая. Возвращает целое число, показывающее позицию начального символа последнего вхождения строки "образец" в строку "строка". Необязательный третий аргумент "делитель" – это число символов, используемых для разбиения "образец" на отдельные подстроки. Например, CHAR.RINDEX(var1, 'abcd') возвращает значение начальной позиции последнего появления полной строки "abcd" в переменной var1, CHAR.RINDEX(var1, 'abcd', 1) возвращает значение позиции последнего появления в строке любого из этих значений, а CHAR.RINDEX(var1, 'abcd', 2) возвращает значение начальной позиции последнего появления либо "ab", либо "cd". Аргумент "делитель" должен быть положительным целым числом и должен делить нацело длину "образец". Если «needle» (образец) не найден, то возвращается значение 0.
char.rindex(3)16=16@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(строка,образец[,делитель]). Числовая. Возвращает целое число, показывающее позицию начального символа последнего вхождения строки "образец" в строку "строка". Необязательный третий аргумент "делитель" – это число символов, используемых для разбиения "образец" на отдельные подстроки. Например, CHAR.RINDEX(var1, 'abcd') возвращает значение начальной позиции последнего появления полной строки "abcd" в переменной var1, CHAR.RINDEX(var1, 'abcd', 1) возвращает значение позиции последнего появления в строке любого из этих значений, а CHAR.RINDEX(var1, 'abcd', 2) возвращает значение начальной позиции последнего появления либо "ab", либо "cd". Аргумент "делитель" должен быть положительным целым числом и должен делить нацело длину "образец". Если «needle» (образец) не найден, то возвращается значение 0.
char.rindex(2)13=13@Char.Rindex(2)@CHAR.RINDEX(?,?)@CHAR.RINDEX(строка,образец[,делитель]). Числовая. Возвращает целое число, показывающее позицию начального символа последнего вхождения строки "образец" в строку "строка". Необязательный третий аргумент "делитель" – это число символов, используемых для разбиения "образец" на отдельные подстроки. Например, CHAR.RINDEX(var1, 'abcd') возвращает значение начальной позиции последнего появления полной строки "abcd" в переменной var1, CHAR.RINDEX(var1, 'abcd', 1) возвращает значение позиции последнего появления в строке любого из этих значений, а CHAR.RINDEX(var1, 'abcd', 2) возвращает значение начальной позиции последнего появления либо "ab", либо "cd". Аргумент "делитель" должен быть положительным целым числом и должен делить нацело длину "образец". Если «needle» (образец) не найден, то возвращается значение 0.
char.rindex(3)13=13@Char.Rindex(3)@CHAR.RINDEX(?,?,?)@CHAR.RINDEX(строка,образец[,делитель]). Числовая. Возвращает целое число, показывающее позицию начального символа последнего вхождения строки "образец" в строку "строка". Необязательный третий аргумент "делитель" – это число символов, используемых для разбиения "образец" на отдельные подстроки. Например, CHAR.RINDEX(var1, 'abcd') возвращает значение начальной позиции последнего появления полной строки "abcd" в переменной var1, CHAR.RINDEX(var1, 'abcd', 1) возвращает значение позиции последнего появления в строке любого из этих значений, а CHAR.RINDEX(var1, 'abcd', 2) возвращает значение начальной позиции последнего появления либо "ab", либо "cd". Аргумент "делитель" должен быть положительным целым числом и должен делить нацело длину "образец". Если «needle» (образец) не найден, то возвращается значение 0.
char.rpad(2)16=16@Char.Rpad(2)@CHAR.RPAD(?,?)@CHAR.RPAD(текствыр1,длн[,текствыр2]). Текстовая. Дополняет справа текстовое выражение "текствыр1" выражением "текствыр2", чтобы довести его длину до значения, заданного аргументом "длн", используя при этом в качестве дополняющего текста столько полных копий "текствыр2", сколько их может войти. Значение длины представляет собой число символов и должно быть положительным целым числом. Необязательный третий аргумент "текствыр2" является строкой в кавычках или выражением, ссылающимся на строку. При отсутствии "текствыр2" значение будет дополнено пробелами.
char.rpad(3)16=16@Char.Rpad(3)@CHAR.RPAD(?,?,?)@CHAR.RPAD(текствыр1,длн[,текствыр2]). Текстовая. Дополняет справа текстовое выражение "текствыр1" выражением "текствыр2", чтобы довести его длину до значения, заданного аргументом "длн", используя при этом в качестве дополняющего текста столько полных копий "текствыр2", сколько их может войти. Значение длины представляет собой число символов и должно быть положительным целым числом. Необязательный третий аргумент "текствыр2" является строкой в кавычках или выражением, ссылающимся на строку. При отсутствии "текствыр2" значение будет дополнено пробелами.
char.substr(2)16=16@Char.Substr(2)@CHAR.SUBSTR(?,?)@CHAR.SUBSTR(текствыр,плж[,длн]). Текстовая. Возвращает подстроку, начинающуюся с позиции "плж" символа текстового выражения "текствыр". Необязательный третий аргумент представляет собой число символов в подстроке. При отсутствии необязательного аргумента "длн" возвращается подстрока, начинающаяся с позиции "плж" символа текстового выражения "текствыр" и идущая до конца данного выражения. Например, CHAR.SUBSTR('abcd', 2) возвращает 'bcd', а CHAR.SUBSTR('abcd', 2, 2) возвращает 'bc'.
char.substr(3)16=16@Char.Substr(3)@CHAR.SUBSTR(?,?,?)@CHAR.SUBSTR(текствыр,плж[,длн]). Текстовая. Возвращает подстроку, начинающуюся с позиции "плж" символа текстового выражения "текствыр". Необязательный третий аргумент представляет собой число символов в подстроке. При отсутствии необязательного аргумента "длн" возвращается подстрока, начинающаяся с позиции "плж" символа текстового выражения "текствыр" и идущая до конца данного выражения. Например, CHAR.SUBSTR('abcd', 2) возвращает 'bcd', а CHAR.SUBSTR('abcd', 2, 2) возвращает 'bc'.
concat16=16@Concat@CONCAT(?,?)@CONCAT(стрвыр, стрвыр[,..]) Текстовая. Возвращает текст, являющийся объединением всех ее аргументов, которые должны быть текстовыми. Эта функция требует задания двух или более аргументов. В режиме кодировки, если "стрвыр" является текстовой переменной, используйте RTRIM для того, чтобы получить только фактическое текстовое значение без дополнений справа до заданной длины переменной. Например, CONCAT(RTRIM(стрвыр1), RTRIM(стрвыр2)).
cos1=1@Cos@COS(?)@COS(радианы). Числовая. Возвращает значение косинуса для параметра "радианы", значение которого должно быть числом радиан.
ctime.days18=18@Ctime.Days@CTIME.DAYS(?)@CTIME.DAYS(времвыр). Числовая. Возвращает количество дней, включая неполные дни, содержащихся в аргументе "времвыр", который является количеством секунд, выражением времени или переменной формата времени.
ctime.hours18=18@Ctime.Hours@CTIME.HOURS(?)@CTIME.HOURS(времвыр). Числовая. Возвращает количество часов, включая неполные часы, содержащихся в аргументе "времвыр", который является количеством секунд, выражением времени или переменной формата времени.
ctime.minutes18=18@Ctime.Minutes@CTIME.MINUTES(?)@CTIME.MINUTES(времвыр). Числовая. Возвращает количество минут, включая неполные минуты, содержащихся в аргументе "времвыр", который является количеством секунд, выражением времени или переменной формата времени.
ctime.seconds18=18@Ctime.Seconds@CTIME.SECONDS(?)@CTIME.SECONDS(времвыр). Числовая. Возвращает количество секунд, включая неполные секунды, содержащихся в аргументе "времвыр", который является количеством секунд, выражением времени или переменной формата времени.
date.dmy6=6@Date.Dmy@DATE.DMY(?,?,?)@DATE.DMY(день,мес,год). Числовая. Возвращает значение в формате даты, соответствующее заданным дню, месяцу, и году. Аргументы должны преобразовываться в целые числа, с днем месяца между 1 и 31, номером месяца между 1 и 13 и номером года в целочисленном выражении из четырех знаков, превышающем 1582. Для вывода результата в виде даты, присвойте выходной переменной формат даты.
date.mdy6=6@Date.Mdy@DATE.MDY(?,?,?)@DATE.MDY(мес, день,год). Числовая. Возвращает значение в формате даты, соответствующее заданным месяцу, дню и году. Аргументы должны преобразовываться в целые числа, с днем месяца между 1 и 31, номером месяца между 1 и 13 и номером года в целочисленном выражении из четырех знаков, превышающем 1582. Для вывода результата в виде даты, присвойте выходной переменной формат даты.
date.moyr6=6@Date.Moyr@DATE.MOYR(?,?)@DATE.MOYR(мес, год). Числовая. Возвращает значение в формате даты, соответствующее заданным месяцу и году. Аргументы должны преобразовываться в целые числа, с номером месяца между 1 и 13 и номером года в целочисленном выражении из четырех знаков, превышающем 1582. Для вывода результата в виде даты, присвойте выходной переменной формат даты.
date.qyr6=6@Date.Qyr@DATE.QYR(?,?)@DATE.QYR(квартал,год). Числовая. Возвращает значение в формате даты, соответствующее заданным кварталу и году. Аргументы должны преобразовываться в целые числа, с номером квартала между 1 и 4 и номером года в целочисленном выражении из четырех знаков, превышающем 1582. Для вывода результата в виде даты, присвойте выходной переменной формат даты.
date.wkyr6=6@Date.Wkyr@DATE.WKYR(?,?)@DATE.WKYR(номнедел,год). Числовая. Возвращает значение в формате даты, соответствующее заданным номеру недели и году. Аргументы должны превращаться в целочисленные значения с номнедел между 1 и 53, и год - целое с четырьмя цифрами, превосходящее 1582. Возвращаемое значение даты представляет собой первый день заданой недели для того года. Первая неделя начинается 1 января каждого года, поэтому дата, возвращаемая для любого заданного значения недели, зависит от года.Для вывода результата в виде даты, присвойте переменной формат даты.
date.yrday6=6@Date.Yrday@DATE.YRDAY(?,?)@DATE.YRDAY(год,номдня). Числовая. Возвращает значение в формате даты, соответствующее заданным году и номеру дня. Аргументы должны преобразовываться в целые числа, с номером дня года между 1 и 366 и номером года в целочисленном выражении из четырех знаков, превышающем 1582. Для вывода результата в виде даты, присвойте выходной переменной формат даты.
datediff5=5@Datediff@DATEDIFF(?,?,?)@DATEDIFF(датврем2, датврем1, "единица"). Числовая. Вычисляет разность между двумя значениями дат/времени и возвращает целое (с усечением любой дробной части) в заданных единицах дат/времени, где "датврем2" и "датврем1" обе являются переменными формата даты или времени (или числовыми значениями, которые корректно представляют значения дат/времени), а "единица" является одним из следующих строковых буквенных значений, заключенных в кавычки: years, quarters, months, weeks, days, hours, minutes, seconds, соответственно для числа лет, кварталов, месяцев, недель, дней, часов, минут и секунд.
datesum(3)5=5@Datesum(3)@DATESUM(?,?,?)@DATESUM(датврем, значение, "единица", "метод"). Числовая. Вычисляет значение даты или времени, отстоящее на заданное число единиц от заданного значения даты или времени, где датврем является переменной формата даты или времени (или числовым значением, которое корректно представляет значение даты/времени), а "единица" является одним из следующих текстовых буквенных значений, заключенных в кавычки: years, quarters, months, weeks, days, hours, minutes, seconds, соответственно для числа лет, кварталов, месяцев, недель, дней, часов, минут и секунд. Необязательным методом, заключенным в кавычки, может быть "rollover" или "closest". Метод "rollover" переносит избыточные дни в следующий месяц. Метод "closest" использует ближайшую допустимую дату в текущем месяце; он используется по умолчанию. Возвращаемым значением является значение даты/времени, выраженное как число секунд. Чтобы вывести значение как дату/время, установите для переменной соответствующий формат.
datesum(4)5=5@Datesum(4)@DATESUM(?,?,?,?)@DATESUM(датврем, значение, "единица", "метод"). Числовая. Вычисляет значение даты или времени, отстоящее на заданное число единиц от заданного значения даты или времени, где датврем является переменной формата даты или времени (или числовым значением, которое корректно представляет значение даты/времени), а "единица" является одним из следующих текстовых буквенных значений, заключенных в кавычки: years, quarters, months, weeks, days, hours, minutes, seconds, соответственно для числа лет, кварталов, месяцев, недель, дней, часов, минут и секунд. Необязательным методом, заключенным в кавычки, может быть "rollover" или "closest". Метод "rollover" переносит избыточные дни в следующий месяц. Метод "closest" использует ближайшую допустимую дату в текущем месяце; он используется по умолчанию. Возвращаемым значением является значение даты/времени, выраженное как число секунд. Чтобы вывести значение как дату/время, установите для переменной соответствующий формат.
exp1=1@Exp@EXP(?)@EXP(числвыр). Числовая. Возвращает значение е в степени "числвыр", где е - это основание натуральных логарифмов, а "числвыр" - это числовое выражение. Большие значения "числвыр" могут привести к значениям функции, превышающим предельно допустимое.
idf.beta8=8@Idf.Beta@IDF.BETA(?,?,?)@IDF.BETA(p, форма1, форма2). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с Бета-распределением, имеющим заданные параметры формы, равна p.
idf.cauchy8=8@Idf.Cauchy@IDF.CAUCHY(?,?,?)@IDF.CAUCHY(p,плж,мсштб). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с распределением Коши, имеющим заданные параметры положения и масштаба, равна p.
idf.chisq8=8@Idf.Chisq@IDF.CHISQ(?,?)@IDF.CHISQ(p,стсв). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с хи-квадрат распределением, имеющим заданное число степеней свободы стсв, равна p. Например, хи-квадрат значение, значимое на уровне 0.05 с тремя степенями свободы, равно IDF.CHISQ(0.95,3).
idf.exp8=8@Idf.Exp@IDF.EXP(?,?)@IDF.EXP(p, мсштб). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с экспоненциальным распределением, имеющим заданный параметр масштаба, равна p.
idf.f8=8@Idf.F@IDF.F(?,?,?)@IDF.F(p,стсв1,стсв2). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с F распределением, имеющим заданные числа степеней свободы, равна p. Например, значение F, значимое на уровне 0.05 с 3 и 100 степенями свободы, равно IDF.F(0.95,3,100).
idf.gamma8=8@Idf.Gamma@IDF.GAMMA(?,?,?)@IDF.GAMMA(p, форма, мсштб). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с гамма-распределением, имеющим заданные параметры формы и масштаба, равна p.
idf.halfnrm8=8@Idf.Halfnrm@IDF.HALFNRM(?)@IDF.HALFNRM(p, срдн, стдоткл). Числовая. Возвращает значение из полу-нормального распределения с заданными средним и стандартным отклонением, для которого накопленная вероятность равна p.
idf.igauss8=8@Idf.Igauss@IDF.IGAUSS(?,?,?)@IDF.IGAUSS(p,плж, мсштб). Числовая. Возвращает значение из обратного распределения Гаусса с данными параметрами положения и масштаба, для которого накопленная вероятность равна p.
idf.laplace8=8@Idf.Laplace@IDF.LAPLACE(?,?,?)@IDF.LAPLACE(p, срдн, мсштб). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с распределением Лапласа, имеющим заданные среднее и параметр масштаба, равна p.
idf.lnormal8=8@Idf.Lnormal@IDF.LNORMAL(?,?,?)@IDF.LNORMAL(p, a, b). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с лог-нормальным распределением, имеющим заданные параметры, равна p.
idf.logistic8=8@Idf.Logistic@IDF.LOGISTIC(?,?,?)@IDF.LOGISTIC(p, срдн, мсштб). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с логистическим распределением, имеющим заданные среднее и параметр масштаба, равна p.
idf.normal8=8@Idf.Normal@IDF.NORMAL(?,?,?)@IDF.NORMAL(p, срдн, стдоткл). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с нормальным распределением, имеющим заданные среднее и стандартное отклонение, равна p.
idf.pareto8=8@Idf.Pareto@IDF.PARETO(?,?,?)@IDF.PARETO(p, порог, форма). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с распределением Парето, имеющим заданные параметры "порог" и "форма", равна p.
idf.smod8=8@Idf.Smod@IDF.SMOD(?)@IDF.SMOD(p, a, b). Числовая. Возвращает значение из распределения стьюдентизированного максимума модуля с заданными параметрами, вероятность принять значение меньше которого равна вероят.
idf.srange8=8@Idf.Srange@IDF.SRANGE(?)@IDF.SRANGE(p, a, b). Числовая. Возвращает значение из распределения статистики стьюдентизированного размаха с заданными параметрами, вероятность принять значение меньше которого равна вероят.
idf.t8=8@Idf.T@IDF.T(?,?)@IDF.T(p, стсв). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с t-распределением Стьюдента, имеющим заданное число степеней свободы, равна p.
idf.uniform8=8@Idf.Uniform@IDF.UNIFORM(?,?,?)@IDF.UNIFORM(p, мин, макс). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с равномерным распределением, имеющим заданные минимальное и максимальное значения, равна p.
idf.weibull8=8@Idf.Weibull@IDF.WEIBULL(?,?,?)@IDF.WEIBULL(p, a, b). Числовая. Возвращает число, вероятность принять значение меньше которого случайной величиной с распределением Вейбулла, имеющим заданные параметры, равна p.
lag(1)9=9@Lag(1)@LAG(?)@LAG(переменная[, n]). Числовая или текстовая. Значение переменной в предыдущем наблюдении или на n наблюдений раньше. Необязательный второй аргумент n должен быть положительным целым числом; значением по умолчанию является 1. Например, prev4=LAG(gnp,4) возвращает значение "gnp" для четвертого наблюдения перед текущим наблюдением. Первые четыре наблюдения имеют пропущенные системой значения для prev4.
lag(2)9=9@Lag(2)@LAG(?,?)@LAG(переменная[, n]). Числовая или текстовая. Значение переменной в предыдущем наблюдении или на n наблюдений раньше. Необязательный второй аргумент n должен быть положительным целым числом; значением по умолчанию является 1. Например, prev4=LAG(gnp,4) возвращает значение "gnp" для четвертого наблюдения перед текущим наблюдением. Первые четыре наблюдения имеют пропущенные системой значения для prev4.
length16=16@Length@LENGTH(?)@LENGTH(текствыр). Числовая. Возвращает длину в байтах текстового выражения "текствыр". Для текстовых переменных в режиме Unicode это значение является количеством байт в каждом значении, исключая конечные пробелы, но в режиме кодовой страницы оно определяет длину переменной, исключая конечные пробелы. Чтобы получить длину в байтах без концевых пробелов в режиме кодовой страницы, используйте LENGTH(RTRIM(текствыр)).
lg101=1@Lg10@LG10(?)@LG10(числвыр). Числовая. Возвращает логарифм по основанию 10 для числового выражения "числвыр", значение которого должно быть числом большим 0.
ln1=1@Ln@LN(?)@LN(числвыр). Числовая. Возвращает логарифм по основанию е для числового выражения "числвыр", значение которого должно быть числом, большим 0.
lngamma1=1@Lngamma@LNGAMMA(?)@LNGAMMA(числвыр). Числовая. Возвращает логарифм полной гамма функции аргумента числвыр, который должен быть числовым и большим, чем 0.
lower16=16@Lower@LOWER(?)@LOWER(текствыр). Текстовая. Возвращает "текствыр" с заменой прописных букв на строчные, оставляя прочие символы без изменений. Аргумент должен быть текстовой переменной или значением. Например, LOWER(имя1) возвращает "иван", если значением переменной "имя1" является "Иван".
ltrim(1)16=16@Ltrim(1)@LTRIM(?)@LTRIM(текствыр[,симв]). Текстовая. Возвращает "текствыр" с удаленными предшествующими вхождениями "симв". Если аргумент "симв" не задан, удаляются предшествующие пробелы. Аргумент "симв" должен быть преобразован в одиночный символ.
ltrim(2)16=16@Ltrim(2)@LTRIM(?,?)@LTRIM(текствыр[,симв]). Текстовая. Возвращает "текствыр" с удаленными предшествующими вхождениями "симв". Если аргумент "симв" не задан, удаляются предшествующие пробелы. Аргумент "симв" должен быть преобразован в одиночный символ.
max13=13@Max@MAX(?,?)@MAX(значение,значение[,..]). Числовая или текстовая. Возвращает максимальное значение из аргументов, имеющих непропущенное значение. Эта функция требует задания двух или более аргументов. Для числовых значений можно указать минимальное число допустимых аргументов функции, подлежащих оценке.
max15=15@Max@MAX(?,?)@MAX(значение,значение[,..]). Числовая или текстовая. Возвращает максимальное значение из аргументов, имеющих непропущенное значение. Эта функция требует задания двух или более аргументов. Для числовых значений можно указать минимальное число допустимых аргументов функции, подлежащих оценке.
mblen.byte16=16@Mblen.Byte@MBLEN.BYTE(?,?)@MBLEN.BYTE(текствыр,плж). Числовая. Возвращает число байт в символе в позиции байта "плж" аргумента "текствыр".
mean15=15@Mean@MEAN(?,?)@MEAN(числвыр,числвыр[,..]). Числовая. Возвращает арифметическое среднее аргументов, имеющих допустимые, непропущенные значения. Эта функция требует двух или более аргументов, которые должны быть числовыми выражениями. Вы можете указать(через точку после имени функции) минимальное число непропущенных аргументов, при котором функция вычисляется.
median15=15@Median@Median(?,?)@MEDIAN(числвыр,числвыр[,..]). Числовая. Возвращает медиану (50-й процентиль) аргументов, имеющих допустимые, непропущенные значения. Эта функция требует двух или более аргументов, которые должны быть числовыми выражениями. Вы можете указать(через точку после имени функции) минимальное число непропущенных аргументов, при котором функция вычисляется.
min13=13@Min@MIN(?,?)@MIN(значение,значение[,..]). Числовая или текстовая. Возвращает минимальное значение среди аргументов, имеющих допустимые, непропущенные значения. Эта функция требует задания двух или более аргументов. Для числовых значений можно указать минимальное число допустимых аргументов функции, подлежащих оценке.
min15=15@Min@MIN(?,?)@MIN(значение,значение[,..]). Числовая или текстовая. Возвращает минимальное значение среди аргументов, имеющих допустимые, непропущенные значения. Эта функция требует задания двух или более аргументов. Для числовых значений можно указать минимальное число допустимых аргументов функции, подлежащих оценке.
missing10=10@Missing@MISSING(?)@MISSING(переменная). Логическая. Возвращает 1 или истина, если переменная имеет пропущенное значение (системное или пользовательское). Аргументом должно быть имя переменной в активном наборе данных.
mod1=1@Mod@MOD(?,?)@MOD(числвыр,модуль). Числовая. Возвращает остаток от деления "числвыр" на "модуль". Оба аргумента должны быть числовыми, и "модуль" не должен быть равен 0."
ncdf.beta2=2@Ncdf.Beta@NCDF.BETA(?,?,?,?)@NCDF.BETA(quant, shape1, shape2, nc). Числовая. Возвращает накопленную вероятность того, что случайная величина с нецентральным бета-распределением, имеющим заданные значения параметров формы и нецентральности nc, будет меньше, чем q.
ncdf.chisq2=2@Ncdf.Chisq@NCDF.CHISQ(?,?,?)@NCDF.CHISQ(quant, df,nc). Числовая. Возвращает накопленную вероятность того, что случайная величина с нецентральным хи-квадрат распределением, имеющим заданные значения числа степеней свободы "стсв" и параметра нецентральности nc, будет меньше, чем q.
ncdf.f2=2@Ncdf.F@NCDF.F(?,?,?,?)@NCDF.F(quant, df1, df2, nc). Числовая. Возвращает накопленную вероятность того, что случайная величина с нецентральным F-распределением, имеющим заданные значения чисел степеней свободы "стсв1", "стсв2" и параметра нецентральности nc, будет меньше, чем q.
ncdf.t2=2@Ncdf.T@NCDF.T(?,?,?)@NCDF.T(quant, df, nc). Числовая. Возвращает накопленную вероятность того, что случайная величина с нецентральным t-распределением Стьюдента, имеющим заданные значения числа степеней свободы "стсв" и параметра нецентральности nc, будет меньше, чем q.
nmiss10=10@Nmiss@NMISS(?)@NMISS(variable[,..]). Числовая. Возвращает число пропущенных значений в аргументах. Эта функция требует одного или более аргументов, которые должны быть именами переменных активного набора данных.
normalize16=16@Normalize@NORMALIZE(?)@NORMALIZE(strexp). Текстовая. Возвращает нормализованную версию «strexp» (текстовое выражение). В режиме Unicode возвращает Unicode NFC (нормальная форма C). В режиме кодировки не действует и возвращает «strexp» без изменения. Длина результата может быть различной в зависимости от входной длины.
npdf.beta11=11@Npdf.Beta@NPDF.BETA(?,?,?,?)@NCDF.BETA(q, форма1, форма2, nc). Числовая. Возвращает значение плотности вероятности нецентрального бета распределения с данными параметрами формы и нецентральности в точке quant.
npdf.chisq11=11@Npdf.Chisq@NPDF.CHISQ(?,?,?)@NPDF.CHISQ(q, стсв, nc). Числовая. Возвращает значение плотности вероятности нецентрального распределения хи-квадрат с числом степеней свободы стсв и заданным параметром нецентральности в точке quant.
npdf.f11=11@Npdf.F@NPDF.F(?,?,?,?)@NPDF.F(q,стсв1,стсв2,nc). Числовая. Возвращает значение плотности вероятности нецентрального F-распределения с числами степеней свободы "стсв1" и "стсв2", а также заданным параметром нецентральности "нц" в точке quant.
npdf.t11=11@Npdf.T@NPDF.T(?,?,?)@NPDF.T(q, стсв, nc). Числовая. Возвращает значение плотности вероятности нецентрального t-распределения Стьюдента с заданным числом степеней свободы «стсв» и параметром нецентральности «nc» в точке «q».
ntrim16=16@Ntrim@NTRIM(?)@NTRIM(имя_переменной). Возвращает значение «имя_переменной» без удаления конечных пробелов. Значение имени переменной должно являться именем переменной; оно не может быть выражением.
number3=3@Number@NUMBER(?,?)@NUMBER(strexpr,format). Числовая. Возвращает значение текстового выражения «strexpr» в виде числа. Второй аргумент формат представляет собой числовой формат, используемый для чтения текствыр. Таким образом, если имя - это восьмисимвольная строка, содержащая символьное представление числа, то NUMBER(имя, f8) - это числовое представление этого числа. (Для вывода значения в качестве данных, используйте команду FORMATS или PRINT FORMATS). Если текстовое значение нельзя преобразовать в указанный формат, то функция возвращает системное пропущенное значение.
nvalid10=10@Nvalid@NVALID(?)@NVALID(переменная[,..]). Числовая. Возвращает число аргументов, имеющих валидные, непропущенные значения. Эта функция требует одного или более аргументов, которые должны быть именами переменных активного набора данных.
pdf.bernoulli11=11@Pdf.Bernoulli@PDF.BERNOULLI(?,?)@PDF.BERNOULLI(q,p). Числовая. Возвращает вероятность того, что значение из распределения Бернулли с данным параметром вероятности будет равен quant.
pdf.beta11=11@Pdf.Beta@PDF.BETA(?,?,?)@PDF.BETA(q, форма1, форма2). Числовая. Возвращает значение плотности вероятности бета распределения с данными параметрами формы в точке quant.
pdf.binom11=11@Pdf.Binom@PDF.BINOM(?,?,?)@PDF.BINOM(q,n,p). Числовая. Возвращает вероятность того, что число успехов в n испытаниях с вероятностью каждого успеха "вероят" будет равно quant. Если n равно 1, то результат идентичен тому, что дает CDF.BERNOULLI.
pdf.bvnor11=11@Pdf.Bvnor@PDF.BVNOR(?,?,?)@PDF.BVNOR(quant1, quant2, corr). Числовая. Возвращает значение плотности вероятности стандартного двумерного нормального распределения с данным параметром корреляции в точке quant1, quant2.
pdf.cauchy11=11@Pdf.Cauchy@PDF.CAUCHY(?,?,?)@PDF.CAUCHY(quant, loc, scale). Числовая. Возвращает значение плотности вероятности распределения Коши с данными параметрами положения и масштаба в точке quant.
pdf.chisq11=11@Pdf.Chisq@PDF.CHISQ(?,?)@PDF.CHISQ(q,стсв). Числовая. Возвращает значение плотности вероятности распределения хи-квадрат с числом степеней свободы стсв в точке quant.
pdf.exp11=11@Pdf.Exp@PDF.EXP(?,?)@PDF.EXP(q, форма). Числовая. Возвращает значение плотности вероятности экспоненциального распределения с данным параметром формы в точке quant.
pdf.f11=11@Pdf.F@PDF.F(?,?,?)@PDF.F(q,стсв1,стсв2). Числовая. Возвращает значение плотности вероятности F-распределения с числами степеней свободы стсв1 и стсв2 в точке quant.
pdf.gamma11=11@Pdf.Gamma@PDF.GAMMA(?,?,?)@PDF.GAMMA(quant, shape, scale). Числовая. Возвращает значение плотности вероятности гамма-распределения с данными параметрами формы и масштаба в точке quant.
pdf.geom11=11@Pdf.Geom@PDF.GEOM(?,?)@PDF.GEOM(q,p). Числовая. Возвращает вероятность того, что минимальное число испытаний, необходимых чтобы получить успех, когда вероятность успеха задает параметр вероят, будет равно quant.
pdf.halfnrm11=11@Pdf.Halfnrm@PDF.HALFNRM(?,?,?)@PDF.HALFNRM(quant, mean, stddev). Числовая. Возвращает значение плотности вероятности полу-нормального распределения с заданными средним и стандартным отклонением в точке quant.
pdf.hyper11=11@Pdf.Hyper@PDF.HYPER(?,?,?,?)@PDF.HYPER(quant, total, sample, hits). Числовая. Возвращает вероятность того, что число объектов с заданной характеристикой, когда "выборка" объектов извлечены случайно из генеральной совокупности объема "всего", в которой "усп" объектов имеют заданную характеристику, будет равно quant.
pdf.igauss11=11@Pdf.Igauss@PDF.IGAUSS(?,?,?)@PDF.IGAUSS(quant, loc, scale). Числовая. Возвращает значение плотности вероятности обратного распределения Гаусса с данными параметрами положения и масштаба в точке quant.
pdf.laplace11=11@Pdf.Laplace@PDF.LAPLACE(?,?,?)@PDF.LAPLACE(quant, mean, scale). Числовая. Возвращает значение плотности вероятности распределения Лапласа с данными параметрами среднего и масштаба в точке quant.
pdf.lnormal11=11@Pdf.Lnormal@PDF.LNORMAL(?,?,?)@PDF.LNORMAL(q, a, b). Числовая. Возвращает значение плотности вероятности логнормального распределения с заданными параметрами в точке quant.
pdf.logistic11=11@Pdf.Logistic@PDF.LOGISTIC(?,?,?)@PDF.LOGISTIC(quant, mean, scale). Числовая. Возвращает значение плотности вероятности логистического распределения с заданными параметрами среднего и масштаба в точке quant.
pdf.negbin11=11@Pdf.Negbin@PDF.NEGBIN(?,?,?)@PDF.NEGBIN(quant, thresh, prob). Числовая. Возвращает вероятность того, что минимальное число испытаний, необходимых чтобы получить "порог" успехов, когда вероятность успеха равна "вероят", будет равно quant.
pdf.normal11=11@Pdf.Normal@PDF.NORMAL(?,?,?)@PDF.NORMAL(quant, mean, stddev). Числовая. Возвращает значение плотности вероятности нормального распределения с заданными средним и стандартным отклонением в точке quant.
pdf.pareto11=11@Pdf.Pareto@PDF.PARETO(?,?,?)@PDF.PARETO(quant, threshold, shape). Числовая. Возвращает значение плотности вероятности распределения Парето с заданными параметрами порога и формы в точке quant.
pdf.poisson11=11@Pdf.Poisson@PDF.POISSON(?,?)@PDF.POISSON(quant, mean). Числовая. Возвращает вероятность того, что значение из распределения Пуассона с заданным средним или параметром интенсивности будет равно quant.
pdf.t11=11@Pdf.T@PDF.T(?,?)@PDF.T(quant, df). Числовая. Возвращает значение плотности вероятности t-распределения Стьюдента с заданным числом степеней свободы «df» в точке «quant».
pdf.uniform11=11@Pdf.Uniform@PDF.UNIFORM(?,?,?)@PDF.UNIFORM(quant, min, max). Числовая. Возвращает значение плотности вероятности равномерного распределения с заданными минимумом и максимумом в точке «quant».
pdf.weibull11=11@Pdf.Weibull@PDF.WEIBULL(?,?,?)@PDF.WEIBULL(quant, a, b). Числовая. Возвращает значение плотности вероятности распределения Вейбулла с заданными параметрами в точке quant.
range13=13@Range@RANGE(?,?,?)@RANGE(test,lo,hi[,lo,hi,..]). Логическая. Возвращает 1 или истина, если значение "пров" находится внутри какого-либо интервала, заданного парой мин, макс; концы интервала включаются. Аргументы должны быть одновременно все числовыми или все строками одинаковой длины, и каждая из пар мин, макс должна быть упорядочена так, чтобы мин <= макс. Примечание: Результаты в виде текстовых значений могут варьироваться в зависимости от установок языковых параметров системы, даже в случае одного и того же набора символов, поскольку языковые установки управляют также последовательностью символов. Порядок в соответствии с языком, а не порядок ASCII, определяет, в какое место должен попадать определенный символ.
replace(3)13=13@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). Текстовая. Если в a1 обнаружено a2, то a2 заменяются на a3. Необязательный аргумент a4 задает количество раз, которое а2 будет заменяться на a3; если a4 опущено, то замены будут производится во всех случаях обнаружения a2. Аргументы a1, a2 и a3 должны преобразовываться к текстовыми значениям (текстовые строки, заключенные в кавычки, или текстовые переменные), а необязательный аргумент a4 должен преобразовываться к неотрицательному целому числу. Например, REPLACE(«abcabc», «a», «x») возвращает значение «xbcxbc», а REPLACE(«abcabc», «a», «x», 1) возвращает значение «xbcabc».
replace(4)13=13@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). Текстовая. Если в a1 обнаружено a2, то a2 заменяются на a3. Необязательный аргумент a4 задает количество раз, которое а2 будет заменяться на a3; если a4 опущено, то замены будут производится во всех случаях обнаружения a2. Аргументы a1, a2 и a3 должны преобразовываться к текстовыми значениям (текстовые строки, заключенные в кавычки, или текстовые переменные), а необязательный аргумент a4 должен преобразовываться к неотрицательному целому числу. Например, REPLACE(«abcabc», «a», «x») возвращает значение «xbcxbc», а REPLACE(«abcabc», «a», «x», 1) возвращает значение «xbcabc».
replace(3)16=16@Replace(3)@REPLACE(?,?,?)@REPLACE(a1, a2, a3[, a4]). Текстовая. Если в a1 обнаружено a2, то a2 заменяются на a3. Необязательный аргумент a4 задает количество раз, которое а2 будет заменяться на a3; если a4 опущено, то замены будут производится во всех случаях обнаружения a2. Аргументы a1, a2 и a3 должны преобразовываться к текстовыми значениям (текстовые строки, заключенные в кавычки, или текстовые переменные), а необязательный аргумент a4 должен преобразовываться к неотрицательному целому числу. Например, REPLACE(«abcabc», «a», «x») возвращает значение «xbcxbc», а REPLACE(«abcabc», «a», «x», 1) возвращает значение «xbcabc».
replace(4)16=16@Replace(4)@REPLACE(?,?,?,?)@REPLACE(a1, a2, a3[, a4]). Текстовая. Если в a1 обнаружено a2, то a2 заменяются на a3. Необязательный аргумент a4 задает количество раз, которое а2 будет заменяться на a3; если a4 опущено, то замены будут производится во всех случаях обнаружения a2. Аргументы a1, a2 и a3 должны преобразовываться к текстовыми значениям (текстовые строки, заключенные в кавычки, или текстовые переменные), а необязательный аргумент a4 должен преобразовываться к неотрицательному целому числу. Например, REPLACE(«abcabc», «a», «x») возвращает значение «xbcxbc», а REPLACE(«abcabc», «a», «x», 1) возвращает значение «xbcabc».
rnd(1)1=1@Rnd(1)@RND(?)@RND(numexpr[,mult,fuzzbits]). Числовая. При одном аргументе возвращает ближайшее целое для этого аргумента. Числа, оканчивающиеся точно на 0,5, округляются в сторону от 0. Например, RND(-4.5) округляет до -5. Необязательный второй аргумент «mult» (от multiplication — умножение) указывает, что результат является целым, умноженным на это значение — например, RND(-4.57,0.1) = -4.6. Значение должно быть числовым, но не может быть равным 0. Значением по умолчанию является 1. Необязательный третий аргумент «fuzzbits» (размытые биты) является количеством наименьших значащих разрядов, на которое «numexpr» (числовое выражение) может не достигать порога для округления (например, 0,5 при округлении до целого), но при этом оставаться округленным. В случае пропуска используется системный параметр FUZZBITS (заданный раным 6 во время установки).
rnd(2)1=1@Rnd(2)@RND(?,?)@RND(numexpr[,mult,fuzzbits]). Числовая. При одном аргументе возвращает ближайшее целое для этого аргумента. Числа, оканчивающиеся точно на 0,5, округляются в сторону от 0. Например, RND(-4.5) округляет до -5. Необязательный второй аргумент «mult» (от multiplication — умножение) указывает, что результат является целым, умноженным на это значение — например, RND(-4.57,0.1) = -4.6. Значение должно быть числовым, но не может быть равным 0. Значением по умолчанию является 1. Необязательный третий аргумент «fuzzbits» (размытые биты) является количеством наименьших значащих разрядов, на которое «numexpr» (числовое выражение) может не достигать порога для округления (например, 0,5 при округлении до целого), но при этом оставаться округленным. В случае пропуска используется системный параметр FUZZBITS (заданный раным 6 во время установки).
rnd(3)1=1@Rnd(3)@RND(?,?,?)@RND(numexpr[,mult,fuzzbits]). Числовая. При одном аргументе возвращает ближайшее целое для этого аргумента. Числа, оканчивающиеся точно на 0,5, округляются в сторону от 0. Например, RND(-4.5) округляет до -5. Необязательный второй аргумент «mult» (от multiplication — умножение) указывает, что результат является целым, умноженным на это значение — например, RND(-4.57,0.1) = -4.6. Значение должно быть числовым, но не может быть равным 0. Значением по умолчанию является 1. Необязательный третий аргумент «fuzzbits» (размытые биты) является количеством наименьших значащих разрядов, на которое «numexpr» (числовое выражение) может не достигать порога для округления (например, 0,5 при округлении до целого), но при этом оставаться округленным. В случае пропуска используется системный параметр FUZZBITS (заданный раным 6 во время установки).
rtrim(1)16=16@Rtrim(1)@RTRIM(?)@RTRIM(текствыр[,симв]). Текстовая. Обрезает внутри «текствыр» концевые вхождения «симв». Необязательный второй аргумент «симв» представляет собой единичный символ, взятый в кавычки, или текстовое выражение, генерирующее единственный символ. Если «симв» пропущен, обрезаются концевые пробелы.
rtrim(2)16=16@Rtrim(2)@RTRIM(?,?)@RTRIM(текствыр[,симв]). Текстовая. Обрезает внутри «текствыр» концевые вхождения «симв». Необязательный второй аргумент «симв» представляет собой единичный символ, взятый в кавычки, или текстовое выражение, генерирующее единственный символ. Если «симв» пропущен, обрезаются концевые пробелы.
rv.bernoulli12=12@Rv.Bernoulli@RV.BERNOULLI(?)@RV.BERNOULLI(p). Числовая. Возвращает псевдо-случайное число, имеющее распределение Бернулли с заданным значением параметра вероятности p.
rv.beta12=12@Rv.Beta@RV.BETA(?,?)@RV.BETA(форма1, форма2). Числовая. Возвращает псевдо-случайное число, имеющее бета-распределение с заданными значениями параметров формы.
rv.binom12=12@Rv.Binom@RV.BINOM(?,?)@RV.BINOM(n, p). Числовая. Возвращает псевдо-случайное число, имеющее биномиальное распределение с заданными значениями числа испытаний n и параметра вероятности p.
rv.cauchy12=12@Rv.Cauchy@RV.CAUCHY(?,?)@RV.CAUCHY(плж, мсштб). Числовая. Возвращает псевдо-случайное число, имеющее распределение Коши с заданными значениями параметров положения и масштаба.
rv.chisq12=12@Rv.Chisq@RV.CHISQ(?)@RV.CHISQ(стсв). Числовая. Возвращает псевдо-случайное число, имеющее распределение хи-квадрат с заданным числом степеней свободы стсв.
rv.exp12=12@Rv.Exp@RV.EXP(?)@RV.EXP(мсштб). Числовая. Возвращает псевдо-случайное число, имеющее экспоненциальное распределение с заданным параметром масштаба.
rv.f12=12@Rv.F@RV.F(?,?)@RV.F(стсв1, стсв2). Числовая. Возвращает псевдо-случайное число, имеющее F-распределение с заданными числами степеней свободы "стсв1" и "стсв2".
rv.gamma12=12@Rv.Gamma@RV.GAMMA(?,?)@RV.GAMMA(форма, мсштб). Числовая. Возвращает псевдо-случайное число, имеющее гамма-распределение с заданными значениями параметров формы и масштаба.
rv.geom12=12@Rv.Geom@RV.GEOM(?)@RV.GEOM(p). Числовая. Возвращает псевдо-случайное число, имеющее геометрическое распределение с заданным значением параметра вероятности p.
rv.halfnrm12=12@Rv.Halfnrm@RV.HALFNRM(?)@RV.HALFNRM(срдн, стдоткл). Числовая. Возвращает случайное число из полу-нормального распределения с заданными средним и стандартным отклонением.
rv.hyper12=12@Rv.Hyper@RV.HYPER(?,?,?)@RV.HYPER(всего, выборка, усп). Числовая. Возвращает псевдо-случайное число, имеющее гипергеометрическое распределение с заданными значениями параметров.
rv.igauss12=12@Rv.Igauss@RV.IGAUSS(?,?)@RV.IGAUSS(плж, мсштб). Числовая. Возвращает псевдо-случайное число, имеющее обратное распределение Гаусса с заданными значениями параметров положения и масштаба.
rv.laplace12=12@Rv.Laplace@RV.LAPLACE(?,?)@RV.LAPLACE(срдн, мсштб). Числовая. Возвращает псевдо-случайное число, имеющее распределение Лапласа с заданными значениями параметров среднего и масштаба.
rv.lnormal12=12@Rv.Lnormal@RV.LNORMAL(?,?)@RV.LNORMAL(a, b). Числовая. Возвращает псевдо-случайное число, имеющее лог-нормальное распределение с заданными значениями параметров.
rv.logistic12=12@Rv.Logistic@RV.LOGISTIC(?,?)@RV.LOGISTIC(срдн, мсштб). Числовая. Возвращает псевдо-случайное число, имеющее логистическое распределение с заданными значениями параметров среднего и масштаба.
rv.negbin12=12@Rv.Negbin@RV.NEGBIN(?,?)@RV.NEGBIN(порог, p). Числовая. Возвращает случайное число из отрицательного биномиального распределения с заданными значениями параметров порога и вероятности.
rv.normal12=12@Rv.Normal@RV.NORMAL(?,?)@RV.NORMAL(срдн, стдоткл). Числовая. Возвращает случайное число из нормального распределения с заданным средним и стандартным отклонением.
rv.pareto12=12@Rv.Pareto@RV.PARETO(?,?)@RV.PARETO(порог, форма). Числовая. Возвращает псевдо-случайное число, имеющее распределение Парето с заданными значениями параметров "порог" и "форма".
rv.poisson12=12@Rv.Poisson@RV.POISSON(?)@RV.POISSON(срдн). Числовая. Возвращает псевдо-случайное число, имеющее распределение Пуассона с заданным значением параметра среднего или интенсивности.
rv.t12=12@Rv.T@RV.T(?)@RV.T(стсв). Числовая. Возвращает псевдо-случайное число, имеющее t-распределение Стьюдента с заданным числом степеней свободы стсв.
rv.uniform12=12@Rv.Uniform@RV.UNIFORM(?,?)@RV.UNIFORM(мин, макс). Числовая. Возвращает псевдо-случайное число, имеющее равномерное распределение с заданными значениями минимума и максимума. Смотри также функцию UNIFORM.
rv.weibull12=12@Rv.Weibull@RV.WEIBULL(?,?)@RV.WEIBULL(a, b). Числовая. Возвращает псевдо-случайное число, имеющее распределение Вейбулла с заданными значениями параметров.
sd15=15@Sd@SD(?,?)@SD(числвыр,числвыр[,..]). Числовая. Возвращает стандартное отклонение для аргументов, имеющих допустимые непропущенные значения. Эта функция требует двух или более аргументов, которые должны быть числовыми выражениями. Вы можете указать(через точку после имени функции) минимальное число непропущенных аргументов, при котором функция вычисляется.
sig.chisq14=14@Sig.Chisq@SIG.CHISQ(?)@SIG.CHISQ(q, стсв). Числовая. Возвращает вероятность того, что значение из распределения хи-квадрат с числом степеней свободы стсв будет больше чем q.
sig.f14=14@Sig.F@SIG.F(?)@SIG.F(q, стсв1, стсв2). Числовая. Возвращает накопленную вероятность того, что значение из F-распределения с числами степеней свободы стсв1 и стсв2 будет больше, чем q.
sin1=1@Sin@SIN(?)@SIN(радианы). Числовая. Возвращает значение синуса для числового выражения "радианы", значение которого должно быть числом, выраженным в радианах.
sqrt1=1@Sqrt@SQRT(?)@SQRT(числвыр). Числовая. Возвращает положительное значение квадратного корня из значения числового выражения "числвыр", которое должно быть неотрицательным числом.
strapplymodel19=19@Strapplymodel@StrApplyModel(?,?,?)@StrApplyModel(дескриптор, "функция", значение) Текстовая. Применяет конкретную функцию скоринга к входным данным наблюдений, используя модель, заданную вручную, где "функция" представляет собой одно из следующих текстовых буквенных значений, заключенных в кавычки: predict, stddev, probability, confidence, nodeid, cumhazard, neighbor, distance. Дескриптор модели является именем, соответствующим внешнему файлу XML, как это определено в команде MODEL HANDLE. Необязательный третий аргумент используется с функциями: "probability", "neighbor" и "distance". В функции "probability" он указывает категорию, для которой вычисляется вероятность. В функциях "neighbor" и "distance" он указывает конкретного соседа (как целое число) для моделей ближайшего соседа. StrApplyModel возвращает пустую строку, если значение не может быть вычислено.
string3=3@String@STRING(?,?)@STRING(числвыр,формат). Текстовая. Возвращает результат преобразования "числвыр" в строку согласно формату. STRING(-1.5,F5.2) возвращает текстовое значение '-1.50'. Второй аргумент формат должен быть числовым форматом.
strunc16=16@Strunc@STRUNC(?,?)@STRUNC (текствыр, длн). Текстовая. Возвращает текстовое выражение «текствыр», которое сначала было урезано по длине (в байтах), а затем с у него были отсечены все концевые пробелы. Урезание удаляет любой элемент символа, поддающийся удалению.
sum15=15@Sum@SUM(?,?)@SUM(числвыр,числвыр[,..]). Числовая. Возвращает сумму аргументов с допустимыми непропущенными значениями. Эта функция требует двух или более аргументов, которые должны быть числовыми выражениями. Вы можете указать(через точку после имени функции) минимальное число непропущенных аргументов, при котором функция вычисляется.
sysmis10=10@Sysmis@SYSMIS(?)@SYSMIS(нумпер). Логическая. Возвращает 1 или истина, если значение переменной "нумпер" - системное пропущенное. Аргумент "нумпер" должен быть именем числовой переменной из активного набора данных.
time.days17=17@Time.Days@TIME.DAYS(?)@TIME.DAYS(дни). Числовая. Возвращает интервал времени, соответствующий указанному числу дней. Аргумент должен быть числовым. Для вывода результата в виде времени, присвойте выходной переменной формат времени.
time.hms(1)17=17@Time.Hms(1)@TIME.HMS(?)@TIME.HMS(часы[,мин,сек]). Числовая. Возвращает интервал времени, соответствующий указанному числу часов, минут и секунд. Аргументы «минуты» и «секунды» являются необязательными. Минуты и секунды должны выражаться в числах меньших 60, если любой аргумент более высокого порядка не равняется нулю. Все аргументы, за исключением последнего ненулевого, должны выражаться в целых числах. К примеру, TIME.HMS(25.5) и TIME.HMS(0,90,25.5) являются допустимыми выражениями, в то время как TIME.HMS(25.5,30) и TIME.HMS(25,90) — недопустимыми. Все аргументы должны быть представлены либо всеми положительными, либо всеми отрицательными значениями. Для вывода результата в виде времени, присвойте выходной переменной формат времени.
time.hms(2)17=17@Time.Hms(2)@TIME.HMS(?,?)@TIME.HMS(часы[,мин,сек]). Числовая. Возвращает интервал времени, соответствующий указанному числу часов, минут и секунд. Аргументы «минуты» и «секунды» являются необязательными. Минуты и секунды должны выражаться в числах меньших 60, если любой аргумент более высокого порядка не равняется нулю. Все аргументы, за исключением последнего ненулевого, должны выражаться в целых числах. К примеру, TIME.HMS(25.5) и TIME.HMS(0,90,25.5) являются допустимыми выражениями, в то время как TIME.HMS(25.5,30) и TIME.HMS(25,90) — недопустимыми. Все аргументы должны быть представлены либо всеми положительными, либо всеми отрицательными значениями. Для вывода результата в виде времени, присвойте выходной переменной формат времени.
time.hms(3)17=17@Time.Hms(3)@TIME.HMS(?,?,?)@TIME.HMS(часы[,мин,сек]). Числовая. Возвращает интервал времени, соответствующий указанному числу часов, минут и секунд. Аргументы «минуты» и «секунды» являются необязательными. Минуты и секунды должны выражаться в числах меньших 60, если любой аргумент более высокого порядка не равняется нулю. Все аргументы, за исключением последнего ненулевого, должны выражаться в целых числах. К примеру, TIME.HMS(25.5) и TIME.HMS(0,90,25.5) являются допустимыми выражениями, в то время как TIME.HMS(25.5,30) и TIME.HMS(25,90) — недопустимыми. Все аргументы должны быть представлены либо всеми положительными, либо всеми отрицательными значениями. Для вывода результата в виде времени, присвойте выходной переменной формат времени.
trunc(1)1=1@Trunc(1)@TRUNC(?)@TRUNC(числвыр,множ,фузбиты). Числовая. Возвращает значение числового выражения «числвыр», обрезанного в сторону 0. Необязательный второй аргумент «множ» указывает, что результат является целочисленным множителем данного значения—к примеру, TRUNC(4.579,0.1) = 4.5. Значение должно быть числовым, но не может быть равно 0. Необязательный третий аргумент «фузбиты» - это число наименее значимых бит, на которое «числвыр» можно обрезать, не доходя до ближайшей границы округления, а также округлить перед обрезанием. Например, если значение «числвыр» между 1,4 и 1,5, а «множ» составляет 0,1, то аргумент «фузбиты» задает, насколько близко «числвыр» может подходить к 1,5 (ближайшей границе округления) и округляться. В случае пропуска используется системный параметр FUZZBITS (заданный раным 6 во время установки).
trunc(2)1=1@Trunc(2)@TRUNC(?,?)@TRUNC(числвыр,множ,фузбиты). Числовая. Возвращает значение числового выражения «числвыр», обрезанного в сторону 0. Необязательный второй аргумент «множ» указывает, что результат является целочисленным множителем данного значения—к примеру, TRUNC(4.579,0.1) = 4.5. Значение должно быть числовым, но не может быть равно 0. Необязательный третий аргумент «фузбиты» - это число наименее значимых бит, на которое «числвыр» можно обрезать, не доходя до ближайшей границы округления, а также округлить перед обрезанием. Например, если значение «числвыр» между 1,4 и 1,5, а «множ» составляет 0,1, то аргумент «фузбиты» задает, насколько близко «числвыр» может подходить к 1,5 (ближайшей границе округления) и округляться. В случае пропуска используется системный параметр FUZZBITS (заданный раным 6 во время установки).
trunc(3)1=1@Trunc(3)@TRUNC(?,?,?)@TRUNC(числвыр,множ,фузбиты). Числовая. Возвращает значение числового выражения «числвыр», обрезанного в сторону 0. Необязательный второй аргумент «множ» указывает, что результат является целочисленным множителем данного значения—к примеру, TRUNC(4.579,0.1) = 4.5. Значение должно быть числовым, но не может быть равно 0. Необязательный третий аргумент «фузбиты» - это число наименее значимых бит, на которое «числвыр» можно обрезать, не доходя до ближайшей границы округления, а также округлить перед обрезанием. Например, если значение «числвыр» между 1,4 и 1,5, а «множ» составляет 0,1, то аргумент «фузбиты» задает, насколько близко «числвыр» может подходить к 1,5 (ближайшей границе округления) и округляться. В случае пропуска используется системный параметр FUZZBITS (заданный раным 6 во время установки).
upcase16=16@Upcase@UPCASE(?)@UPCASE(текствыр). Текстовая. Возвращает текстовое выражение "текствыр" со строчными буквами, замененными на прописные, и неизменными прочими символами.
value10=10@Value@VALUE(?)@VALUE(переменная). Числовая или текстовая. Возвращает значение переменной, игнорируя пользовательские пропущенные значения; аргумент "переменная" должен быть именем переменной или векторной ссылкой на имя переменной.
valuelabel9=9@Valuelabel@VALUELABEL(?)@VALUELABEL(имя_переменной). Текстовая. Возвращает метку значения для значения переменной или пустую строку, если значение не имеет метки. Значение имени переменной должно являться именем переменной; оно не может быть выражением.
variance15=15@Variance@VARIANCE(?,?)@VARIANCE(числвыр,числвыр[,..]). Числовая. Возвращает дисперсию аргументов, имеющих непропущенные значения. Эта функция требует двух или более аргументов, которые должны быть числовыми выражениями. Вы можете указать(через точку после имени функции) минимальное число непропущенных аргументов, при котором функция вычисляется.
xdate.date7=7@Xdate.Date@XDATE.DATE(?)@XDATE.DATE(дата). Числовая. Возвращает в виде даты область даты из числового значения. Аргумент может быть числом, переменной формата даты или выражением, ссылающимся на дату. Для вывода результата в виде даты, присвойте переменной формат даты.
xdate.hour18=18@Xdate.Hour@XDATE.HOUR(?)@XDATE.HOUR(датврем). Числовая. Возвращает значение часа (целое число между 0 и 23) из значения, представляющего собой время или «датврем». Аргумент может быть числом, переменной времени или «датврем», либо выражением, ссылающимся на значение «датврем».
xdate.jday7=7@Xdate.Jday@XDATE.JDAY(?)@XDATE.JDAY(дата). Числовая. Возвращает значение дня года (целое число между 1 и 366) из числового значения, представляющего собой дату. Аргумент может быть числом, переменной формата даты или выражением, ссылающимся на дату.
xdate.mday7=7@Xdate.Mday@XDATE.MDAY(?)@XDATE.MDAY(дата). Числовая. Возвращает значение дня месяца (целое число между 1 и 31) из числового значения, представляющего собой дату. Аргумент может быть числом, переменной формата даты или выражением, ссылающимся на дату.
xdate.minute18=18@Xdate.Minute@XDATE.MINUTE(?)@XDATE.MINUTE(датврем). Числовая. Возвращает значение минуты (целое число между 0 и 59) из значения, представляющего собой время или «датврем». Аргумент может быть числом, переменной времени или «датврем», либо выражением, ссылающимся на значение времени или «датврем».
xdate.month7=7@Xdate.Month@XDATE.MONTH(?)@XDATE.MONTH(дата). Числовая. Возвращает значение месяца (целое число между 1 и 12) из числового значения, представляющего собой дату. Аргумент может быть числом, переменной формата даты или выражением, ссылающимся на дату.
xdate.quarter7=7@Xdate.Quarter@XDATE.QUARTER(?)@XDATE.QUARTER(дата). Числовая. Возвращает значение квартала года (целое число между 1 и 4) из числового значения, представляющего собой дату. Аргумент может быть числом, переменной формата даты или выражением, ссылающимся на дату.
xdate.second18=18@Xdate.Second@XDATE.SECOND(?)@XDATE.SECOND(датврем). Числовая. Возвращает значение секунды (целое число между 0 и 60) из значения, представляющего собой время или «датврем». Аргумент может быть числом, переменной времени или «датврем», либо выражением, ссылающимся на значение «датврем».
xdate.tday7=7@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(время). Числовая. Возвращает количество полных дней (в виде целого числа) из числового значения, представляющего собой интервал времени. Аргумент может быть числом, переменной формата времени или выражением, ссылающимся на интервал времени.
xdate.tday18=18@Xdate.Tday@XDATE.TDAY(?)@XDATE.TDAY(время). Числовая. Возвращает количество полных дней (в виде целого числа) из числового значения, представляющего собой интервал времени. Аргумент может быть числом, переменной формата времени или выражением, ссылающимся на интервал времени.
xdate.time7=7@Xdate.Time@XDATE.TIME(?)@XDATE.TIME(датврем). Числовая. Возвращает область времени из значения, представляющего собой время или «датврем». Аргумент может быть числом, переменной времени или «датврем», либо выражением, ссылающимся на значение «датврем». Для вывода результата в виде времени, присвойте переменной формат времени.
xdate.week7=7@Xdate.Week@XDATE.WEEK(?)@XXDATE.WEEK(дата). Числовая. Возвращает номер недели (целое число между 1 и 53) из числового значения, представляющего собой дату. Аргумент может быть числом, переменной формата даты или выражением, ссылающимся на дату.
xdate.wkday7=7@Xdate.Wkday@XDATE.WKDAY(?)@XDATE.WKDAY(дата). Числовая. Возвращает номер дня недели (целое число между 1, воскресенье, и 7, субботой) из числового значения, представляющего собой дату. Аргумент может быть числом, переменной формата даты или выражением, ссылающимся на дату.
xdate.year7=7@Xdate.Year@XDATE.YEAR(?)@XDATE.YEAR(дата). Числовая. Возвращает значение года (целое число с четырьмя знаками) из числового значения, представляющего собой дату. Аргумент может быть числом, переменной формата даты или выражением, ссылающимся на дату.
yrmoda7=7@Yrmoda@YRMODA(?,?,?)@YRMODA(год,месяц,день). Числовая. Возвращает число дней с 15 октября 1582 до даты, представляемой аргументами "год", "месяц" и "день", которые должны быть целыми, образующими осмысленную дату, считая от 15 октября 1582. Двухзначные значения года предполагают столетие, задаваемое в окне Параметры (меню Правка, пункт Параметры, закладка Данные). По умолчанию, двухзначный год предполагает интервал, начинающийся 69 годами ранее текущей даты и кончающийся 30 годами позже текущей даты.
